In [30]:
import pandas as pd
import numpy as np

In [31]:
!ls

Data
README.md
Untitled.ipynb

In [32]:
df_train = pd.read_csv('Data/train.csv',index_col=0)

In [33]:
df_test = pd.read_csv('Data/test.csv',index_col=0)

In [34]:
df_train.head()

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
id,,,,,,,,,,,,,
0,15674932,Okwudilichukwu,668,France,Male,33.0,3,0.00,2,1.0,0.0,181449.97,0
1,15749177,Okwudiliolisa,627,France,Male,33.0,1,0.00,2,1.0,1.0,49503.50,0
2,15694510,Hsueh,678,France,Male,40.0,10,0.00,2,1.0,0.0,184866.69,0
3,15741417,Kao,581,France,Male,34.0,2,148882.54,1,1.0,1.0,84560.88,0
4,15766172,Chiemenam,716,Spain,Male,33.0,5,0.00,2,1.0,1.0,15068.83,0

In [35]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 165034 entries, 0 to 165033
Data columns (total 13 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   CustomerId       165034 non-null  int64
 1   Surname          165034 non-null  object
 2   CreditScore      165034 non-null  int64
 3   Geography        165034 non-null  object
 4   Gender           165034 non-null  object
 5   Age              165034 non-null  float64
 6   Tenure           165034 non-null  int64
 7   Balance          165034 non-null  float64
 8   NumOfProducts    165034 non-null  int64
 9   HasCrCard        165034 non-null  float64
 10  IsActiveMember   165034 non-null  float64
 11  EstimatedSalary  165034 non-null  float64
 12  Exited           165034 non-null  int64
dtypes: float64(5), int64(5), object(3)
memory usage: 17.6+ MB

In [36]:
df_train.isna().sum()

CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [37]:
df_train['Exited'].value_counts()

0    130113
1     34921
Name: Exited, dtype: int64

In [38]:
df_train.describe()

,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
count,1.650340e+05,165034.000000,165034.000000,165034.000000,165034.000000,165034.000000,165034.000000,165034.000000,165034.000000,165034.000000
mean,1.569201e+07,656.454373,38.125888,5.020353,55478.086689,1.554455,0.753954,0.497770,112574.822734,0.211599
std,7.139782e+04,80.103340,8.867205,2.806159,62817.663278,0.547154,0.430707,0.499997,50292.865585,0.408443
min,1.556570e+07,350.000000,18.000000,0.000000,0.000000,1.000000,0.000000,0.000000,11.580000,0.000000
25%,1.563314e+07,597.000000,32.000000,3.000000,0.000000,1.000000,1.000000,0.000000,74637.570000,0.000000
50%,1.569017e+07,659.000000,37.000000,5.000000,0.000000,2.000000,1.000000,0.000000,117948.000000,0.000000
75%,1.575682e+07,710.000000,42.000000,7.000000,119939.517500,2.000000,1.000000,1.000000,155152.467500,0.000000
max,1.581569e+07,850.000000,92.000000,10.000000,250898.090000,4.000000,1.000000,1.000000,199992.480000,1.000000

In [40]:
df_train['Exited'] = df_train.Exited.astype('object')
df_train['HasCrCard'] = df_train.HasCrCard.astype('object')
df_train['IsActiveMember'] = df_train.IsActiveMember.astype('object')

In [41]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 165034 entries, 0 to 165033
Data columns (total 13 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   CustomerId       165034 non-null  int64
 1   Surname          165034 non-null  object
 2   CreditScore      165034 non-null  int64
 3   Geography        165034 non-null  object
 4   Gender           165034 non-null  object
 5   Age              165034 non-null  float64
 6   Tenure           165034 non-null  int64
 7   Balance          165034 non-null  float64
 8   NumOfProducts    165034 non-null  int64
 9   HasCrCard        165034 non-null  object
 10  IsActiveMember   165034 non-null  object
 11  EstimatedSalary  165034 non-null  float64
 12  Exited           165034 non-null  object
dtypes: float64(3), int64(4), object(6)
memory usage: 17.6+ MB

In [43]:
df_train['Age'].value_counts()

37.00    9255
38.00    9246
35.00    9118
34.00    8625
36.00    8556
         ...
84.00       4
85.00       3
83.00       3
32.34       1
36.44       1
Name: Age, Length: 71, dtype: int64

In [44]:
df_train['Tenure'].value_counts()

2     18045
7     17810
4     17554
8     17520
5     17268
1     16760
9     16709
3     16630
6     15822
10     5909
0      5007
Name: Tenure, dtype: int64

In [46]:
df_train['CreditScore'].value_counts()

850    2532
678    2299
684    1718
667    1658
705    1605
       ...
358       1
386       1
373       1
419       1
423       1
Name: CreditScore, Length: 457, dtype: int64